In [2]:
import pandas as pd

df = pd.DataFrame({
    'country' : ['India', 'US', 'Japan', 'Australia', 'Japan'],
    'age' : [44,34,46,35,23],
    'salary' : [72000, 65000, 98000, 45000, 34000]
})
df

     country  age  salary
0      India   44   72000
1         US   34   65000
2      Japan   46   98000
3  Australia   35   45000
4      Japan   23   34000

In [3]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        1   44   72000
1        3   34   65000
2        2   46   98000
3        0   35   45000
4        2   23   34000

In [5]:
 label_encoder.classes_

array(['Australia', 'India', 'Japan', 'US'], dtype=object)

In [6]:
df = pd.DataFrame({
    'country' : ['India', 'US', 'Japan', 'Australia', 'Japan'],
    'age' : [44,34,46,35,23],
    'salary' : [72000, 65000, 98000, 45000, 34000]
})
df

     country  age  salary
0      India   44   72000
1         US   34   65000
2      Japan   46   98000
3  Australia   35   45000
4      Japan   23   34000

In [7]:
X = df['country'].values.reshape(-1,1)
X

array([['India'],
       ['US'],
       ['Japan'],
       ['Australia'],
       ['Japan']], dtype=object)

In [8]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
X = onehot_encoder.fit_transform(X).toarray()
X

array([[0., 1., 0., 0.],
       [0., 0., 0., 1.],
       [0., 0., 1., 0.],
       [1., 0., 0., 0.],
       [0., 0., 1., 0.]])

In [9]:
onehot_encoder.categories_

[array(['Australia', 'India', 'Japan', 'US'], dtype=object)]

In [10]:
df_onehot = pd.DataFrame(X, columns=[str(1) for i in range(X.shape[1])])
df_onehot

     1    1    1    1
0  0.0  1.0  0.0  0.0
1  0.0  0.0  0.0  1.0
2  0.0  0.0  1.0  0.0
3  1.0  0.0  0.0  0.0
4  0.0  0.0  1.0  0.0

In [11]:
df = pd.concat([df_onehot, df], axis=1)
df

     1    1    1    1    country  age  salary
0  0.0  1.0  0.0  0.0      India   44   72000
1  0.0  0.0  0.0  1.0         US   34   65000
2  0.0  0.0  1.0  0.0      Japan   46   98000
3  1.0  0.0  0.0  0.0  Australia   35   45000
4  0.0  0.0  1.0  0.0      Japan   23   34000

In [12]:
df = df.drop(['country'], axis = 1)
df

     1    1    1    1  age  salary
0  0.0  1.0  0.0  0.0   44   72000
1  0.0  0.0  0.0  1.0   34   65000
2  0.0  0.0  1.0  0.0   46   98000
3  1.0  0.0  0.0  0.0   35   45000
4  0.0  0.0  1.0  0.0   23   34000